[
    {
        "id": "escape_cursed_cabin",
        "name": "Escape the Cursed Cabin",
        "description": "You must uncover the cabin's dark secrets, break the curse, and escape before the entity awakens at dawn.",
        "type": "Sequential",
        "steps": [
            {
                "id": "light_lantern",
                "stepNumber": 1,
                "description": "Light the old lantern to see in the darkness",
                "action": "use",
                "targetObject": "old_lantern",
                "requiredFlags": [],
                "requiredItems": [],
                "requiredLocation": "basement",
                "completionFlag": "lantern_lit",
                "successMessage": "You light the lantern. Its warm glow pushes back the oppressive darkness, revealing details you couldn't see before. The shadows seem to recoil from its light.",
                "failureMessage": "The lantern won't light. You need to find it first.",
                "feedbackMessage": "The flickering flame provides comfort in this haunted place."
            },
            {
                "id": "examine_mirror",
                "stepNumber": 2,
                "description": "Use the cracked mirror to reveal hidden truths",
                "action": "use",
                "targetObject": "cracked_mirror",
                "requiredFlags": [
                    "lantern_lit"
                ],
                "requiredItems": [],
                "requiredLocation": "attic",
                "completionFlag": "mirror_used",
                "successMessage": "You hold the lantern up to the cracked mirror. Through the web of fractures, you see not your reflection, but ancient symbols glowing faintly on the walls around you. They weren't visible before!",
                "failureMessage": "The mirror shows nothing but darkness without proper light.",
                "feedbackMessage": "The mirror holds secrets that only light can reveal."
            },
            {
                "id": "open_chest",
                "stepNumber": 3,
                "description": "Open the wooden chest to find what's hidden inside",
                "action": "use",
                "targetObject": "wooden_chest",
                "requiredFlags": [
                    "mirror_used"
                ],
                "requiredItems": [],
                "requiredLocation": "attic",
                "completionFlag": "chest_opened",
                "stateChanges": [
                    {
                        "target": "iron_key",
                        "property": "IsVisible",
                        "newValue": true
                    }
                ],
                "successMessage": "The chest creaks open, releasing a puff of ancient dust. Inside, you find an ornate iron key covered in strange engravings. This must unlock the main door!",
                "failureMessage": "The chest won't budge. Perhaps you need to discover its secret first.",
                "feedbackMessage": "The chest contains something important for your escape."
            },
            {
                "id": "take_key",
                "stepNumber": 4,
                "description": "Take the mysterious key from the chest",
                "action": "take",
                "targetObject": "iron_key",
                "requiredFlags": [
                    "chest_opened"
                ],
                "requiredItems": [],
                "requiredLocation": "attic",
                "completionFlag": "has_key",
                "successMessage": "You take the heavy iron key. Its surface is cold to the touch, and the engravings seem to shift in the lantern light. This is your ticket to freedom.",
                "failureMessage": "You need to open the chest first to find the key.",
                "feedbackMessage": "The key's weight feels significant in your hand."
            },
            {
                "id": "read_note",
                "stepNumber": 5,
                "description": "Read the crumpled note to understand the curse",
                "action": "examine",
                "targetObject": "crumpled_note",
                "requiredFlags": [
                    "lantern_lit"
                ],
                "requiredItems": [],
                "requiredLocation": "main_room",
                "completionFlag": "note_read",
                "successMessage": "You carefully unfold the water-stained note. In shaky handwriting: 'The entity feeds on fear and darkness. Light keeps it at bay. The key was hidden where truth reflects. Leave before the candle dies, or become like us - chained forever.'",
                "failureMessage": "It's too dark to read the faded writing.",
                "feedbackMessage": "The note contains a warning from those who came before."
            },
            {
                "id": "unlock_door",
                "stepNumber": 6,
                "description": "Use the key to unlock the cabin's main door",
                "action": "use",
                "targetObject": "locked_door",
                "requiredFlags": [
                    "has_key",
                    "note_read"
                ],
                "requiredItems": [
                    "iron_key",
                    "old_lantern"
                ],
                "requiredLocation": "main_room",
                "completionFlag": "door_unlocked",
                "successMessage": "You insert the key into the rusted lock. It turns with a loud click that echoes through the cabin. The door swings open, revealing the storm-swept forest beyond. Fresh air rushes in. You're almost free!",
                "failureMessage": "The door remains sealed. You need the right key and understanding of what you're escaping.",
                "feedbackMessage": "The door stands between you and freedom."
            },
            {
                "id": "escape",
                "stepNumber": 7,
                "description": "Escape through the unlocked door before the entity awakens",
                "action": "use",
                "targetObject": "locked_door",
                "requiredFlags": [
                    "door_unlocked"
                ],
                "requiredItems": [
                    "old_lantern"
                ],
                "requiredLocation": "main_room",
                "completionFlag": "escaped",
                "successMessage": "You rush through the open door into the stormy night. Behind you, the cabin's candle flickers and dies. A terrible shriek erupts from within, but you're already running into the forest. The trees close around you protectively. You've escaped the cursed cabin. The nightmare is over.",
                "failureMessage": "You must unlock the door first, and keep your light burning.",
                "feedbackMessage": "Freedom lies just beyond this threshold."
            }
        ],
        "requiredItems": [],
        "completionMessage": "ESCAPE COMPLETE: You have survived the cursed cabin! Through courage and wit, you uncovered its dark secrets and escaped before becoming another victim. The entity remains trapped, but you are free. The horror is behind you now.",
        "completionAchievementId": "horror_survivor",
        "achievementId": "horror_survivor",
        "hints": [
            {
                "level": 1,
                "text": "Explore the basement to find a source of light. Darkness hides many secrets.",
                "cost": 0,
                "order": 1,
                "delayMinutes": 2
            },
            {
                "level": 2,
                "text": "The cracked mirror in the attic can reveal hidden truths when properly illuminated.",
                "cost": 0,
                "order": 2,
                "delayMinutes": 5
            },
            {
                "level": 3,
                "text": "Read the note carefully - it contains clues about what you need to escape. The chest holds the key to your freedom.",
                "cost": 1,
                "order": 3,
                "delayMinutes": 10
            }
        ]
    }
]